app/controllers/channels_controller.rb

SELECT "channels".* FROM "channels"
---
  def index
    @channels = Channel.all

SELECT "comments".* FROM "comments" WHERE "comments"."channel_id" = ?  [["channel_id", 5]]
---
  def show
    @comments = @channel.comments.all

INSERT INTO "channels" ("name", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Heavy Metal Truants II"], ["picture", "0_IM-ALAN-PARTRIDGE-NEW-SERIES.jpg"], ["created_at", "2021-02-17 10:35:50.914975"], ["updated_at", "2021-02-17 10:35:50.914975"]]
---
  def create
    @channel = Channel.new(channel_params)

    respond_to do |format|
      if @channel.save

DELETE FROM "channels" WHERE "channels"."id" = ?  [["id", 4]]
---
  def destroy
    @channel.destroy

SELECT "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_channel
    @channel = Channel.find(params[:id])