app/controllers/channels_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."channel_id" = ?  [["channel_id", 4]]
---
  def show
    @messages = @channel.messages.all