app/controllers/comments_controller.rb

  def create



    @commentable = Channel.find(comment_params[:channel_id])
    @comment = @commentable.comments.new(comment_params)
    if @comment.save
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("channel_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["channel_id", 1], ["body", "Hello I am a dog"], ["created_at", "2021-02-18 10:02:56.369584"], ["updated_at", "2021-02-18 10:02:56.369584"]]