app/controllers/messages_controller.rb

INSERT INTO "messages" ("user_name", "body", "channel_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_name", "Josh"], ["body", "Testing"], ["channel_id", 4], ["created_at", "2021-02-17 08:12:35.191758"], ["updated_at", "2021-02-17 08:12:35.191758"]]
---
  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save